[
  {
    "rating": "5",
    "content": "People will spend $2k on a great TV or monitor, and yet take issue with a headset that is a standalone device with crystal clear lenses, great FOV, eye tracking, face tracking, and amazing controllers costing $1500.I can see why.  Consumers had the bar set too low in terms of pricing with the Quest 2.  At the end of the day this IS a premium device.  Working inside the quest 2 is uncomfortable and the lenses make it so that you have to move your head to look around.  The lenses on the pro are so clear that you can just move your eyes.This product is a step forward, as it gives developers everything they need to work towards a next-gen experience.Local dimming, foveated rendering, and color passthrough for AR.Sure, the resolution could be higher - but reading 12 pt font is still plenty comfortable.  By the way, even though it's lower than the Quest 2 in terms of total pixels, there are still more pixels per degree (the metric that actually matters).If you just want it for PCVR - it might not be worth it, but if you want to work and experiment with a device (and also want to play some games), this thing is AMAZING."
  },
  {
    "rating": "5",
    "content": "I pre-ordered an Oculus Quest 2 before they launched. Used it a ton prior to the Quest Pro release. Switching to the Pro was quite the eye opener. The faster performance, the incredible lens clarity, the COMFORT, face/eye tracking - this thing is incredible. I purchased this at full price prior to the 33% price drop, and I'd do it again. Don't let the Meta haters talk you out of it.However, writing this review in May of 2023, I recommend most wait for the upcoming Quest 3. It's going to use the identical lenses to the Pro but with higher resolution displays. The dramatically increased processing and graphics power of the Quest 3 will be more future proof.Unfortunately Meta has been extremely slow to implement work features. Last time i checked, I still can't use virtual monitors with a Windows PC, only Mac. If you're buying this for work, just know that it may not speed up your workflow but actually make it worse. For traveling however I've found this to be a useful tool to have more screens while I'm mobile with just a laptop.Overall, for an enthusiast, this headset is great. For the average everyday consumer, I recommend waiting for the Quest 3."
  },
  {
    "rating": "4",
    "content": "Am I crazy/dumb for buying the Pro just months before the Quest 3 launches? I don't think I am.My 256 gb Quest 2 is in danger of running out of space. So with the Q3 base model starting at 128 gb, that's one ding against it. I was this close to just getting a second Q2 used when I started considering the Pro.When I first opened the box, I was literally afraid to touch it. It's so sleek and looks very high end. Putting it on doesn't disappoint - it just feels quality. Turning it on, even after 2-1/2 years in VR, the first glimpse through the pancake lens still gave me a \"wow\" moment. It really is one big sweet spot. The IPD slider rather than the 3 locked positions is fantastic. Playing on it doesn't tire my eyes out the way the Q2 did. I'm also not wasting half my energy shifting it around trying to keep things in focus.The controllers feel great in your hands. Hefty and solid. I won't miss that big halo ring from the Q2.The most important thing about the Pro, to me, is this - nothing sitting on your cheeks. There's a bit of weight on your forehead (a velcro strap across the top of the head helps this) but the rest of your face is totally free. We had this in the first PSVR, and I've missed it. I've added every mod I could think of (even made up some of my own) to the Q2, and that puppy still weighs a bunch, and it feels heavier the longer you keep it on. Yes, the Q3 will have the pancake lens and be \"40% thinner,\" but all the hardware will be back on your face again. The most amazing resolution/pixel density whatever doesn't mean much if you still can't stand to wear the thing for very long.The Pro isn't perfect, of course.  The biggest drawback being the strap is fully integrated into the headset, so if something happens to it, the headset is pretty much done. (The strap is clearly an Elite strap, which Oculus had no shortage of headaches from breakage when that was first introduced. Let's hope they've ironed that out.) Coming from a BoboVR halo strap, I'm used to being able to angle the headset up or down. This has no such adjustment option. There is enormous light leak from below (after-market light blockers work pretty well, but honestly, once you're immersed in a game or activity you barely notice the gap). The controllers are rechargeable only, no swappable batteries (after I've invested a small fortune in rechargeable batteries for the Q2). The charging dock also looks high end but it's quite fiddly placing things correctly on it.Do I regret buying this instead of waiting for Q3? So far, resoundingly no. Hopefully it will stay functional long enough to get me to the Q4 (I have a friend who still uses his Go and has noticed no big difference since support officially ended, only in multiplayer games)."
  },
  {
    "rating": "5",
    "content": "Sure, quest 3 is better no doubt. But if you got extra cash and WANT facetracking, that's your headset.For me, I upgraded from the Rift S to Oculus Quest Pro, and the difference in resolution for me is amazing. I love it. So many features that I never thought I'd have are actually there!Just yes, go for it if you have money and want face tracking, (I only use the headset for PCVR, connected with a cable though, so keep that in mind)"
  },
  {
    "rating": "3",
    "content": "I recently purchased this to upgrade from my first gen Oculus Rift and first gen HTC Vive, which are both several years old now.The bottomline is, for $1600 I was expecting to be blown away. Instead, I came out of it saying, \"Well, this is nice!\".I will rate some of the pertinent aspects from 0 - 10, with 0 being Horrible and 10 being Outstanding.I will not be rating some common aspects like software & library, which is common between all quest and rift products; essentially most people who know about VR, are familiar with the differences in libraries and software etc between different platforms.Product Quality & PackagingScore: 10Very, very impressed by both product quality & packaging. As soon as I started opening the box, I could feel this was a $1600 product. Nicely packaged. Very similar to most 'Apple' products, a bit of minimalism but sturdy, convenient and accessible.The headset feels extremely well constructed. Again, I could tell this was an expensive product while holding it. From glasses to headband to buttons, everything was very professionally polished & built. It did not appear to be 'cheap' in any way and didn't appear they cut corners.Controllers, charging dock, and a couple of accessories included were the same way. Impressive.ComfortScore: 9I'm very impressed. My last headset was the Oculus Rift (First Gen) and HTC Vive (First Gen). Wow!! They have come a long way!! I was astonished.Putting it on and adjusting tightness is extremely easy with the wheel at the back. I didn't have to struggle and finagle with it to make it fit right or sit comfortably. It just did!Nothing goes over or below your ears, or below your eyes, so the rest of your face can breathe and be free. Love it!There is no more glass fogging because you're not breathing up into the glasses. You're breathing below it.I have long eyelashes (go figure!), which usually hit the glasses on my other 2 sets. I was able to adjust the distance of glasses to my eyes which solved that issue.Adjusting lens distance is much easier now, you move the actual lenses.What I loved most is the design which gives you both options; you can leave the area below and around your eyes open - this allows you to see your environment next to you, for example, I got a text on my cell while I was setting this up, I didn't need to remove or even move the headset, I was able to look down and handle my cell with ease.But it also gives you the option to seal it off if you want complete immersive experience and want to disconnect from your surroundings entirely.The only reason I knocked off a point is because after some time the front of the headset started to feel a bit heavy on my forehead, applying some pressure on it. This is understandable, as the primary equipment is all at the front; and this is subjective. It may not bother some people at all.PerformanceScore: 4There is a huge caveat here defined in the next and final rating; but I'll try to keep this separate from that.Viewing area is nice, big, immersive and very colorful. Colors are vivid and overall the picture looks significantly improved over my last 2 headsets.What did disappoint me was that the objects, like frames, borders and edges, seemed very jaggedy and pixelated. They were not smooth as you would expect digital animation or computer graphics to be. For $1600, I expected very sharp edges and solid borders. Moving your eyes/head left-right also made the edges squiggly.This was a very instant let-down, as right after the Meta logo, as setup begins, everything is contained within boxes and frames. I thought I had some setting wrong, but it wasn't so.Screen Door EffectScore: 0The screen door effect was a deal breaker for me. For $1600, I expected next to nothing; I would have lived with 'minimal' as well, but the screen door effect, for me, personally, was horrible!!!Oculus Rift & HTC Vive were several years ago. What bothered me most about VR then was the screen-door effect. I sort of assumed that issue had been fixed or at least minimized to inconsequential all these years later. Like I said, for $1600, I expected little to no screen door effect.It was very prominent for me. Every letter of every word, every box, every circle, every graphic - as I spent more time inside the headset, it only became more and more noticeable to the point where I was seeing it in everything over the colors and graphics.If I'm honest, one of the most important reason I wanted to upgrade to latest gen and higher end VR was to get rid of screen door effect. Huge disappointment.Having said all of the above - keep in mind - I found that screen door effect is also subjective. Some don't see it; some see it but doesn't bother them; and some are like me. I can't stand it.Its also possible this is not the product's fault. Maybe this is the best VR industry can do right now. I don't know. I have no other current/latest VR headsets to compare.Is it improved and better than first gen rift & vive, yes of course! But for me, not enough at all. Not for $1600. If it was a $300 headset, I would live with it and keep it until something better came out in a couple years, just to upgrade from my rift/vive.Final ResultReturned. Already processed return with Amazon and dropped off at UPS Store. That was my experience with Meta Quest Pro. It was short lived and rather disappointing."
  },
  {
    "rating": "1",
    "content": "This headset was purchased for my educational VR-afforded projects and, unfortunately, my decision to send it back was made just after a few minutes of use.It seems that Oculus 2 that I already have is 95% the same as this Quest Pro but at a 1/3 of the price.I thought that the so well promoted hardware-related improvements would be somehow implemented by Meta but, alas, it seems like those features have been incorporated into this headset for only those bravest who know (or will know) how to implement them. So, is that device for creators or developers of programs for creators. If the former is true, I don't see how it's better than Oculus 2. And if the latter is true, well, this is a true beta for developers.Pluses:- [ ] Display clarity (however, there is actually much more glare because the light creeps in from all the directions right onto the lenses, even with the shades installed). I'm confident the decision to make the light-blockers removable was deliberate. But it does make the screen look so bad because of the light bleed.- [ ] FOV: just barely wider (and horizontally only)- [ ] Sharpness: it is much sharper, particularly close to the edges, it has a bigger “sweet-spot” (HOWEVER, you hardly ever notice this as you are likely to look right in the middle of the viewing area. So, when you want to look sideways or up and down, I found it actually easier to do it the way we do in real life -- by moving your head).Negatives:- [ ] Although the sound is louder, it is actually has a lot of rattle (probably because it’s just the same speakers from Oculus 2 with extra amplification)- [ ] The overhyped hand-controllers: they have a lot of jitter / stutter throughout the UI and in programs; per my comparison, they perform much worse than the Oculus 2 controllers.- [ ] The headset is very heavy. The front is as heavy as the Oculus 2, and the counterweight (due to the battery being in the backplate) is not sufficient at all.- [ ] COMFORT: I find the Quest Pro extremely uncomfortable!!! Basically, the entire headset is supposed to stay on stably by the way of squeezing your forehead and the back of your head. Apart from leaving the red mark, it causes headaches after mere minutes of use. I assume this comfort-aspect depends on the curvature/size of a user’s head. I’d recommend consulting a much more reputable reviewer from “roadtovr” who explained this particular issue quite well.- [ ] I find it very unproductive for content creation. My workflow requires that I take the headset on and off numerous times — to track the progress. The stiff design of this Quest Pro makes this task impossible. This contrasts with the Oculus 2, where you can move the headset up and down in relation to the side bars and, when needed, just glance inside without needing of putting the headset on properly.- [ ] Taking it on and off (as well as during adjustments) triggers accidental presses of volume and power buttons since they are located on the underside of the side-bars."
  },
  {
    "rating": "5",
    "content": "I upgrade to a Quest Pro from a Quest 2 and my partner upgraded to a Quest Pro from a Valve Index. We both love our Quest Pros and they feel like a significant upgrade over our prior two headsets in clarity. Plus the face and eye tracking is so nice to have for VRChat. I didn't realize just how much of a difference face and eye tracking would make for social VR. The clarity is amazing. It may seem uncomfortable for some but there are upgraded head pads you can get now that make a big difference. I got a D-Link VR AirBridge for wireless PCVR (would highly recommend). There isn't finger tracking on the controllers like there is with the Valve Knuckle controllers but it makes up for it by the controllers being self tracking without the need for base stations."
  },
  {
    "rating": "5",
    "content": "Got exactly what I paid for, just as advertised, brand new and in factory perfect condition. Price was amazing, lowest I found anywhere at the time. Highly recommended."
  },
  {
    "rating": "4",
    "content": "I got myself a M.Quest 2 to use Quill, I am an animator, and while Steam has some art tools; some of them okay; --  none do what Quill, which is basically Tilt Brush for animation in VR, full send, copy and paste Goro Fujita, and you'll likely buy one of these as well. I wish it weren't the case, but in the end, I was so surprised, coming from an index no less, by the quality of features AND make of the metaquest 2 on the price point; that I decided the flaws were worth the hassle to return and retry that purchase with the big boy version here, and with the foveated rendering, and, if you are developer minded, the OPTION to have that open gap at the bottom, is absolutely awesome for AR dev.It does FOV better than MQ2, but the FOV slide on the lenses is still manual which makes me uncomfortable every time I put my hand near the lens to shove it over, the one time you should need to, or so- but also, I will be looking for some kind of lens protection because while these lenses are bigg, and have FOV kind of very well covered along with the eye-track-foveated rendering helping the image, it's either that nothing because I really cannot say I trust the upper light blocker/glasses guard to prevent scratching. No confidence there, just a precaution, though there are means like lens caps out there that while not absolutely 100% perfect do keep a daily driver from a scratch on the lens, and your soul after it happens.Otherwise, I find the most important functionality of this headset to be like, a console version of a hanheld. Like, if they actually had made a Switch PRO, this also earns that pro name. MOST of everything is better, but I think they may have been serious about that PRO marketing because, the lower lack of light blocking included, and the way it sits on a dock to be able to charge the controllers makes me think this is  an odd one out.This is to say it's mixed; depending exactly on how much very small, (very) detail choices bother you. Like, the having to buy a light blocker, where, natively, I kind of enjoy the available open down-view space, as that is by design for AR work, and for me, functions as I move around my narrow apartment like a cyber ninja and my Index quietly weeps tethered to the PC forever. It's strange now to think of the Index as an \"ah, sure, the older model, yeah, those were good, they don't have some of your standards now, but it'll get ya by\", given how many features the Oculus / Meta Pro / Quest 2 sets add, and how robust and dependable and, remarkably built they are, as a notable stand out. Like, you can, (don't) but you CAN, drop a controller and come back from it (don't, buy a silicone protector, you loon), and that rules, because not since the Duke of VR controllers, the Vive Wand, have controllers not SHATTERED in my hands, or out of them, on first or second or no drop at all. Quality thumsticks, good buttons, GOOD spring resistance, not sure about the cameras, but heck okay.Speaking of cameras, the passthrough is acceptable, remarkable if you're like alright, I know it's not perfect, but is it better than the index? Flat? yes, not leaps and bounds in the visual quality department, in a way I figured mentioning was worth the read if you're this far. Like, this predicates itself on being mixed reality or AR for work, and, I just want to say that while the image quality and stereoscopic imaging is faste enough for me to dart around my narrow apartment; it is NOT a gopro at the same time in image quality either, so, do not expect the monitor quality in the cameras.THANKFULLY, while not exactly that good, it's getting very close these days in the resolution, in wireless and in the customizeable link mode and, I am so late to this headset it feels like I should suggest you wait for the next Valve headset rumored for 23 or 24, or for the meta quest 3 / pro 2 for haptics, foveated rendering 2, but, as a person who crosses these bridges as they come apparently; I'm working in Quill much more happily and quickly in here."
  },
  {
    "rating": "4",
    "content": "After owning this headset for 4 months now and having 500 hours put onto it I'm positive this review is for you.As far as comfortably goes 3/5 stars it's a bit heavy but for 20 dollars you can get a strap for the top of the headset instead of the standard Halo strap it comes withGraphics and gameplay 5/5This headset has been amazing for games like VRchat and general productivity, it does suffer on more heavy titles like beatsaber as the tracking on the controllers like to lose tracking in low light conditionsOverall 4/5If you want an amazing headset for productivity and chill gaming and amazing graphics, if you have a PC that can support what this headset offers then by all means get this headsetIf you have a more lower end PC I'd recommend a Index or a HPreverb and if you just want a standalone VR setup the quest 2 us still king in my opinion."
  },
  {
    "rating": "3",
    "content": "Updated review - save your $ buy the regular Quest 2. Maybe wait on the 3. The Pro has some fantastic features, but there are VERY few programs that take advantage of them.  It's like owning a sports car, but only being able to drive in a school zone.  And those features that are used are, in all honesty, an insignificant upgrade to the Quest 2.  I would have had an equal experience with a Quest 2.About some of those features... the controller / hand tracking is nice, but the Pro doesn't use infrared light for tracking like the Quest. So you need to use it in a space with ample & even lighting. I bounce a fairly strong desk lamp off of the ceiling & it works well. The reason I find this annoying is there is a decent sized gap between the bottom of the headset & my cheeks. The extra light leaking in is a constant distraction.Which brings me to the fit. Generally, it's ok. But at this price, I expect better than ok.Battery life is reasonable. Get about 1.5 hours. That's with all the bells & whistles turned on. My complaint is with the charging dock. The controllers \"find their home\" easily due to magnets. There is also a noticeable haptic feedback. The headset though... I have to mess with it until I hear the charging tone. But I've found even that is unreliable. I've left it \"charging\" for a few hours between sessions, only to find it wasn't aligned \"just\" right. Ok for gaming, but not ok if I'm using it for work. Look for the microscopic charge light & be sure to check it again in about 10 minutes.A brief note about the controllers. The headset can be charged via the dock, or directly by USB type C. However, the controllers can only be charged via a proprietary port (3 pin) on the dock. Fortunately, the Pro does come with a mini \"travel\" dock just for them. However, if you need a new one, it'll set you back $80. That is beyond unreasonable. A simple type C port should have been added. Pure money grab.Last big complaint is there are lots of free programs!!! No. Everything is going to land somewhere between $20 & $40 per program. I would expect at least a few \"show off\" programs that highlight the Pro's upgrades. But like I said at the beginning, the upgrades are just not incorporated into the programs. *MAYBE this will change once the Q3 comes out, but again... why pay a premium for the Pro if a regular Quest will do the job?Unfortunately, there are a large number of deceptive \"free trial / demo\" games available. Anyone old enough to remember the games that would come bundled with the AOL \"free trial\" disks? Yeah, it feels like that. And I mean that in the worst way possible. I went into this expecting at least a few photo realistic programs. But most still have a cartoon feeling or crappy photogrametry. Just like old cartoons, if you pay close attention, you'll notice most everything is actually just layered 2D objects.In short, my opinion, save your money & get a Quest 2. Maybe wait for the Quest 3 (supposedly released later this (2023) year).  Use the money you save towards the programs you'll end up buying.Oh, & you probably threw out 3 pieces when you opened it up. One is a \"clip\" that goes on the left side to help route the charging cable. Nice idea, but stupid execution. The other 2 are \"stylus\" tips that can be used where the wrist straps attach. They just kinda \"sit\" in there, so maybe paint the tips with some ultra bright color. Because you WILL be looking for it on the floor. The fit will feel a bit odd, but when you press them in, that activates the writing function (in certain programs).My suggestion is to watch a few unboxing (strange word) & watch for these parts to be mentioned. Also, don't toss out ANY packaging until you confirm you have every piece listed."
  },
  {
    "rating": "4",
    "content": "I had some damage to the box on arrival and within a week of using it found a dead pixel.  Working with meta to fix problem"
  },
  {
    "rating": "4",
    "content": "The first thing that I will say is that, even though it’s a major upgrade from the quest 2 the pro doesn’t shine as much as you would expect.  Maybe they haven’t done enough to this point to take full advantage of the hardware. As other users have said, there definitely is a sharper image when you’re looking on a different areas.  The edges are definitely more defined.  Watching videos off your computer is definitely a little sharper.  Although the visuals are definitely welcomed, they’re not enough to justify the price tag.  The games are a little bit sharper, but you still have the old games. There’s nothing gnu as far as games or apps, or anything along those lines.  The pass-through is definitely much better with color added, but it is so blurry that it’s almost unusable for things in the room even though you can use it, it’s basically the black-and-white version but now in color that being said, there is a virtual desktop that comes along with the pro that allows you to use your desktop on a computer using the pass-through it is very easy to see your keyboard and your mouse.  The image is sharp enough to see the keys nowhere to put your fingers on the keys. You may not be able to see the letters on the keys very well, but you know if you type for a long time where the keys are by memory, so with the display of your curtains, pewter desktop up and visual images of the keyboard and mouse. It is definitely usable VR version of your computer. However, I things like your phone or TVs or any other images that show on the screen are so bright that you can’t even use them so if you’re setting up a virtual desktop for your computer to use basically the only thing you’re gonna be able to use is your computer and things within the VR headset  overall the price tag is pretty steep, but it is definitely will worth an investment.  I added the full light blocker and it works fairly well. I never use the side blockers I went straight to the full blocker. I have noticed that you have to tighten the headset to keep it on your head. It can’t be loose or it drops down below your eyes when it’s tightened, it does leave an impression on your forehead. It would be nice if there was a top strap that went over the top of your head so you didn’t have to tighten it as tight. I do like the fact that the controllers have chargeable batteries in the dock is pretty nice , overall I think this is a good purchase, even though I think the price tag was pretty steep"
  },
  {
    "rating": "4",
    "content": "I'd give this a 5 star rating if it wasn't for the price. Functionally, the light blocker dramatically increases the overall immersion offered by the Quest Pro; I highly recommend it if you're especially sensitive to distractions, prefer dark room VR or want a fully enclosed and immersive experience.Quality of the product is good, but you will encounter a minor issue with using this product with lens inserts (at least of the VR Optician variety). The bottom piece of the gasket will stick out a bit as it rests near an area where the lens inserts clamp on. It's not a deal breaker and it barely impacts the functionality of the product, but it is worth mentioning.The price is the only gripe I have. $50 for a non-complicated piece of rubber and a few magnetic seems way overpriced.Still, overall, worth it for a lot of VR enthusiasts."
  },
  {
    "rating": "3",
    "content": "As of November 8th, this is a major upgrade compared to the Quest 1! However, I would recommend waiting for some updates before making this hefty purchase.This device comes with a headset, two controllers, two charging cables, lens wipe, two stylus tips, two wrist straps, partial light blockers, and a charging dock.The two charging cables are odd. One is for the charging dock or the headset, yet it does not act like a Oculus Link cable. So, if you want PC gaming, you still need to purchase a cable for it. The other charger is for charging individual controllers; a really weird addition for a $1500 to only include chargers for only one controller at a time, but also a bit weird to include it at all when there is a dock that charges it anyways.Secondly, the partial light blockers, as described, covers the left side and right side of the headset; you can still see under the headset. If you want full immersion, then you must purchase full light blockers. Again, weird to not include for a $1500 headset.Thirdly, the weight isn't too bad. The device doesn't rest against your face, but rather the forehead. All the weight is balanced so it feels lighter and doesn't weigh on one side of your head, which I greatly appreciate!Pros: Major graphic overhaul. I've played BeatSaber on the Quest 1 and the Pro, and the Pro version definitely improved how everything looks. It definitely was worth the price, because I could barely tell the difference with Quest Pro BeatSaber graphics with PC BeatSaber graphics.Along with that, YouTube VR and Netflix is better quality as well. No more discernable pixels along edges, and more immersion.The Pro also has face and eye tracking, but it isn't as useful for me since I wear glasses.The pass-through is decent for the price. You can't see small details like text on a phone, but seeing your home environment for navigating isn't too bad. For mixed reality, it still could be better, but works as intended and is decently functional.Cons: Due to how recent this device was release, everything needs to be updated to adapt to it. Not only have I encountered multiple crashes for the apps advertised, like Meta Horizon Workrooms, some just don't work properly. I'm still waiting for Meta Horizon Workrooms to update, because it literally crashes at launch.Again, for the $1500 price, you'd expect all this to be fixed, but as of now, a handful of things need to be fixed. Like the title suggest, wait a bit before purchasing to let all the apps iron out the kinks."
  },
  {
    "rating": "4",
    "content": "These work as described and sound pretty good! The aren't amazing for music listening but sound good for general VR usage with no issues"
  },
  {
    "rating": "3",
    "content": "I recently purchased the Meta Quest Pro, and while I had high hopes for this new virtual reality headset, I must admit that I have encountered several issues that have left me feeling underwhelmed. Here's my honest review:Connection Issues: The headset consistently loses connection to the controllers, and at times, it gets stuck in a sleep state that requires a hard reboot. This has been quite frustrating, especially when I'm in the middle of a gaming session.Charging Station: The charging station is poorly designed, lacking a magnetic feature to secure the connection. I've found myself fumbling with it constantly, trying to align the charging pins correctly. A simple magnetic connection would have made this process much smoother.Charging Status and Charge State: It's not easy to see the charging status and charge state of the headset. A more intuitive indicator system would be a welcome improvement.Comfort and Weight: The Meta Quest Pro is relatively heavy and uncomfortable to wear for extended periods. I had to purchase a thicker padding for my forehead to alleviate the discomfort. A lighter and more ergonomic design is definitely needed for future iterations.Battery Life: The battery life is quite weak and doesn't last long. Combined with the problematic charging station, this issue has significantly impacted my overall experience.Controller Feedback: The controller feedback is impressive when it works, providing immersive and enjoyable vibrations.Game and App Library: Although the Meta Quest Pro has some exclusive content, there aren't many popular games or apps that set it apart from its predecessor, the Meta Quest II. An expanded library of exclusive content would help justify the upgrade.Price: The price decrease from $1,500 to $999 is a significant bonus and makes the headset more accessible to a wider audience.Recommendations for the next iteration:Lighten the headset and improve comfortEnhance padding for better user experienceIncrease battery lifeImplement a magnetic charging solutionClearly indicate charging status and charge stateIn summary, the Meta Quest Pro has the potential to be an excellent VR headset, but it's currently marred by several issues that need to be addressed. A few key improvements would significantly enhance the user experience and make it a worthy successor to the Meta Quest II."
  },
  {
    "rating": "4",
    "content": "This is a fine system. Perhaps a bit overkill for my current needs but I am very happy with the purchase. There is a very minimum learning curve, great processing power, and it's ergonomically sound!I think there are endless possibilities from a cooperate perspective which is inclusive of training / collaboration. And of course the gaming aspect is outstanding.A few things that I found cumbersome: They system requires updating and a \"burn-in\" period of about a day or so. This is really more of a software/firmware issue vice hardware.I found that many of the included applications were initially glitchy but worked fine after restarting the system and allowing for recalibration. Since updating the system and a few restart, I've zero issues.Although Meta reduced the price point, this system should have come with a longer power cable, case and external battery pack. Customer service  really needs improving as I requested a call back within an hour (on day one) and they did call me back ...8 hours later at 3AM EST. But kudos to them for following up.Overall a very solid 4.5 stars. I would have given 5 if they included a case, longer power cable, and external battery."
  },
  {
    "rating": "4",
    "content": "Just wrote a really cool and long review detailing everything and then it got deleted causei went to a new page by mistake so now short an simply.rating - 4/5 stars lost 1 star ONLY because of the high price.Display - 10/10 absolutely stunningBattery - 2-3 hours ( i dont use face or eye tracking) this is further boosted by a small attachable battery pack I bought so for me its around 5hours+ of gameplay.Feel and quality - Very Premium and really nicePrice - 3/10 A fat L, would only buy if you really want it. If not just wait for quest 3.Usage - I only used with AirLink and Steam VR (worked amazing, did look up a YouTube video on how to fully optimize it which made it from a 6/10 experience to a 10/10 AMAZING experience!)Controllers - 100000/10 amazing tracking and works wonders, only lost tracking twice when opening and closing the menu, should be fixable with software updates.Color passthrough - Really nice that I don't have to take off my headset if I want a drink or to do something real quick. cant read shit but overall I only use it if I need to do some thing minor in the real world.Charging plate - Mad in love with the charging plate, its sleek, premium, and compact and sits on my desk really nicely.Overall really pleased with this headset, how ever if you are contemplating getting it and are on the edge for the cost and you already have a VR headset that works fine, then I say just wait the 6months give or take for the quest 3 to come out. Basically should be the same just without facial tracking."
  },
  {
    "rating": "4",
    "content": "I recently purchased the Meta Quest Pro Full Light Blocker to take my VR gaming sessions to the next level, and I'm quite satisfied with the results! The light-blocking capabilities of this accessory are impressive, making my VR environment much more immersive by eliminating distractions. The easy snap-in installation to the Meta Quest Pro headset is convenient, though I wish it didn't interfere with charging on the dock. The material feels comfortable against the face, and it's a significant improvement over the standard light-blocking options. While the price is a bit steep for what it offers, the enhanced visuals and increased focus during gameplay make it a worthwhile addition to my setup."
  },
  {
    "rating": "3",
    "content": "I do like that it has face and eye built in and support has been made to make it work on PCVR. However for some reason my quest app on my PC no longer connects to it properly and I can't hear a thing when using it that way. Thankfully virtual desktop now supports the face and eye tracking on it as well so I was able to start using it again. Can't wait till someone makes an sdk to make the tongue tracking work too for when I sing in VR."
  },
  {
    "rating": "2",
    "content": "I wanted to love this headset. Truly. But it has too many downsides:- Less comfortable than my rift s- Due to no DisplayPort, requires 1.6k graphics card + motherboard + power unit to be able to take advantage of the pixels in the displays. With a DisplayPort this wouldn’t be a problem. The graphics card has to encode/decode the signal since it’s sending it through USB. While I liked wireless, I don’t like it as much as I like 4,000.- Did I mention how uncomfortable this was? It was much better with a full face mask on the rift s- Light leakage galore. Even with a rediculously overpriced piece of thin silicone you still get leakage on the nose.- “well, I’ll just turn down the lights to solve the leakage” you think. No, you won’t because then the controls won’t track.- software is super buggy. Even with the lights on the controllers spaz out, point in the wrong directions, etc- want to connect to your computer? That’s like 5 clicks every time, nested inside of settings —> devices —> link —> select computer —> connect and then wait for a buggy load of the old quest software. Why are these two separate softwares?- Want to change settings? Well there’s the quest mobile settings, the quest link settings, airlink settings, quest debug tool settings, and oculus desktop app settings. Good luck.- The visuals are really not THAT much better than the rift s. Maybe with 4k blasted on new everything on a computer, but frankly a 2080 should be more than enough and it’s not because no display port was added.- Dim display. Found myself wanting to turn the brightness up but surprise, that’s not in any of the 4 settings menus.Again, I REALLY wanted to like this headset so much. I’m excited for the tech. I just don’t want a 1k tech demo with 300 dollars of accessories to make it usable and 3k of computer equipment to actually fully use my 1k headset because of no display port while I have to fiddle with janky disparate software and 4 overlapping settings menus. Really hope they nail this with the O3 or a Pro 2 headset. Please make it comfortable. Go back to the full ski mask."
  },
  {
    "rating": "3",
    "content": "After 3 months of usage it has died and I have 1k$ device that I don't know what to do with. Sad, despite of the fact it's pretty good VR headset with great picture, sound, battery and ergonomic(you should get used to it though). It's time to get back to my Quest 2 and now I have one extra pair of pro controllers after all.UPDATE: It's alive. I don't know why and how but in a few days it has revived. 4 stars because I think it's overpriced anyway. A good VR headset if you don't count the money!UPDATE 2023-10-03: Just got overheating message and it's turned off. New firmware update - new problems. I'm guessing it's soft problem(you know there is quest 3 release soon) but if not... it's sad. I kinda tired of meta's headsets reliability. They don't live more than a year.UPDATE 2023-10-08: It's not software problem but hardware, something with battery. It's dead. Enough said. RIP Quest Pro. Your life was short but bright.P.S. Meantime I've preordered Quest 3, hope it will live much longer"
  },
  {
    "rating": "4",
    "content": "I'm a monitor snob. 4K is my baseline. When I saw reviewers using the Quest Pro for virtual monitors I had to give it a try. Well... no, we're going to need higher res screens to make that work well.The guided adjust to your eyesight feature is promising but it tells me to move the dial to the left further than the dial will go, probably because my noggin is huge. One size fits all hats, don't. Comfort could be better. It's still an improvement over the Rift S.I'm usually tethered so battery life isn't a problem. I picked Anker's cable. Works.I find myself agreeing with the open sides and bottom design. Besides helping with situational awareness it's good for ventilation. I tried the included blinders and took them back off. Given that there's no good way to lift up and rest the screen on your forehead when you need to interact with the real world not being completely blind is helpful.Worth the money? Not for me, but I'll keep it and hope something interesting software-wise comes along.  If someone makes a headset that tethers to my PC, adjusts accurately to my eyes, and is sharp enough to make reading text easy on my eyes... that would get my attention."
  },
  {
    "rating": "4",
    "content": "It's ok, trying to get the most out of it... disappointed that it doesn't like mobile hotspots (if you want to save some money) because it seems to be a big data hog, you'll need really fast internet. Searching google and watching YouTube works with my hotspot but couldn't open other websites or watch movies on Prime (which works just fine with my laptop, Xbox, phone etc.), it doesn't even open reddit that's like 90% just plain text. So that... but everything else is good, the image is better than the quest 2 and it doesn't get that blurry when you move your head or headset a little bit; also, way more comfortable. You'll have to decide for yourself; better to find a way to try them both before buying."
  },
  {
    "rating": "4",
    "content": "Pro- Clarity on new lenses are amazing. Despite relatively low resolution compared to competitors, new lenses type and higher ppi makes up for it. It's like switching low quality 4k panel to higher quality 4k panel.- Seamless wireless play for headset alone or airlink to pc. If you have wifi 6 and good internet connection, it will look just as good as wired connection to pc.- Awesome new controller and tracking.Cons- Pass through camera quality is very bad. You can't read anything out of it. This is supposed to be mixed reality headset, not just VR but with front camera quality this bad, you can forget about this so called mixed reality. If VR stuff looks crystal clear and real world looks super grainy with low resolution, what's the point?- Stability of headset is somewhat bad. I am afraid of this headset popping out of my head when I make big fast motion movement. Even if I tighten it up super hard, I get this same wobbly feeling of insecurity when making big movement while having blood flowing issue to my head due to tighten up lock too hard.- Cost.. $1500 for this? really? $1000 sounds like much more reasonable price for this somewhat incomplete AR headset."
  },
  {
    "rating": "3",
    "content": "First of all this device is WAY overpriced, but I expected it to be at least twice as good as my Meta Quest 2. Not even close. Some things are better like the screen (in some games - more blurry in others) and the fact that I can now use the device without my prescription glasses and see the text clearly. But it's not nearly as immersive, you can see everything under you no matter how you adjust the headset. Even with the \"blackout\" pieces installed which only black out the sides, a lot of light still comes in. The charger is very nice and I do like that. I like the design and feel of the new controllers, but since it doesn't have the ring part, it can't correctly pick up thumb gestures. I used to be able to give people a \"thumbs up\" and no longer can. I do like the new head fitting as it can be adjusted on the fly without having to take the device off to adjust, but it is much heavier in the back. It feels like they moved the \"computer\" part to the back of the device instead of the goggles as it's pretty good size. If this item were around $599 then I could probably live with the issues, but not at $1500. Save your money, go with the Meta Quest 2 at least until they get some of these issues fixed (if they can). You will get a more immersive experience with proper hand tracking."
  },
  {
    "rating": "3",
    "content": "I hated the strap on this thing. I had so much trouble getting it to fit and it was never comfortable to me. It was always squeezing my head too tight and giving me a headache. If I loosened it up it would flop out of focus too easily.  I couldn't get the adjustable IPD to give me a consistent clear view without excessive eye strain. Since there is no top strap it presses on/against your forehead. This would smoosh my forehead skin down and I would have to keep my eyes in a shocked expression in order to see, further exacerbating my headache. I hated the charging dock. It was annoying to get it in the right position. While the display was a little bit better than my Quest 2, the poor fit made it not worth it for me. It wasn't a drastic, $600 improvement difference. They should have put the same strap that the Rift S had on it. I'm keeping my fingers crossed that the Quest 3 won't be like this one."
  },
  {
    "rating": "2",
    "content": "I have been a huge fan of VR for a long time. I loved my original Oculus Rift (the first widely available consumer VR headset for gaming). It made me obsessed with VR and the future of VR tech. But that came out 6 years ago, and this Quest Pro doesn't do anything better than that old headset, except being wireless - but the Quest 2 is also wireless, for less than a third of the price of this one. The Quest Pro is heavy, difficult to comfortably align with your eyes, has short battery life, allows light to leak in from the bottom of your fov (on purpose!), and the fancy new controllers that cost a fortune when bought separately feel sluggish compared to the old ones, plus they are much heavier as well. My headset lost tracking with the controllers frequently, making video games like Beat Saber impossible to play.The visual color passthrough feature of the Quest Pro is interesting, but it is currently super buggy, and not useful in its current implementation. It frequently identifies objects across the room as being nearby, and nearby objects as being far away. It's also difficult to turn off and on, and when you do turn it on it completely interrupts whatever app you're using.The Quest Pro features Meta's supposedly revolutionary \"pancake lens\" technology, which results in the front part of the headset being smaller, but they do not have a very good image, and they are very very difficult to center on your eyes and keep in focus. You can probably imagine that the headset easily shifts and move slightly while in use and you turn your head (which is normal) but those slight shifts cause the lenses to move off-center from your eyes, and you lose focus.The headset is uncomfortable. It is much heavier than every previous headset, and instead of a strap on the top of your head (which is also sometimes uncomfortable), this one squeezes the back of your head and your forehead, resulting in a tight feeling that gets tiring quickly.I am disappointed in the direction that Meta is taking virtual reality. They claim to be focused on gaming and work collaboration, but in practice it feels like they are focused on nothing at all. For such an incredibly steep price, this headset has no winning features. It's not comfortable, it's not useful, and it's not fun."
  },
  {
    "rating": "5",
    "content": "Alright, let's get down to it. The Meta Quest Pro. Oh man, where to begin.I'll admit it, I was like a kid on Christmas morning when I got this. And, for about three weeks, I couldn't put it down. I mean, we're talking non-stop use.And now... well, it's kinda become a bit of a dust collector. But that's on me, not the headset.Despite the lack of current usage, I've gotta say - this thing is a BEAST. It's clear as day, and I've not used a VR headset yet that can hold a candle to it. It's balanced, comfortable, and the mixed reality passthrough is absolutely next-level.I love it. Absolutely love it. I might not use it every day, but when I do, it's a game-changer. So, if you're on the fence about getting it, I'd say go for it."
  },
  {
    "rating": "4",
    "content": "When I received my quest pro it's look like an Apple product. The Quest Pro has a better display and it's more faster that the Quest 2. For my prospective the quest pro it's designed more for working and who works in 3D design.Why for me the Quest 2 still winning?.The Quest 2 has better hours battery, Strap is removable, it's more easy to clean after days of use.For me Quest 2 feel more portable that Quest Pro."
  },
  {
    "rating": "3",
    "content": "I love my Quest Pro, but its ergonomics suck. This continues with these light blockers. They feel flimsy along the cheeks and tickle quite a bit. The material isn't the most pleasant to the skin. They fold a bit at their contact point that can be a a nuisance. The less you know you are wearing a light blocker, the better. This item fails in this regard. I have a large nose and have the lenses as close to my face as possible. Light leaks in the nose area, even when the front pad is removed to bring my face as close to the lenses as possible. I don't mind this too much, as its nice to get a peak of the real world. But the set that comes with the headset already serve this purpose. Unless you really can't stand the limitations of the side blockers, I would try them for a while before purchasing these \"full\" light blockers. I have since quit using this item and went back those that came in the box, which I have adjusted to more than expected."
  },
  {
    "rating": "4",
    "content": "First opening the box everything felt legitimate. But as soon as I put on the headset and turned it on felt like what they were saying it was vs what they were seeing was not the same perspective and clarity I feel most were looking for . Yes everything was sharper but the games are not optimized for pro and using it on pc looks good but in the distance objects are crisp jaggy rather than the quest 2 blurry jaggy. Which does not really improve game graphics just makes things sharper . Color is excellent through the new lenses . I feel a lot of us got ripped off for the 1500$ we paid and meta should give everyone back at least 400$ as they dropped the price"
  },
  {
    "rating": "3",
    "content": "The display was great compared to the quest 2, I immediately noticed a much sharper and clearer image using PCVR, but after about 5ish hours of light use (I don't hammer down on the thumbstick like a crack head) the left stick starting having drift so severe I had to crank up the dead zone very high just to stop it, then I had to jam the thumbstick forward just to move at maximum forward movement in games. I went through the process of replacing but today the RIGHT thumbstick starting doing the SAME THING, now I could replace them for free, but after paying $1,000 and having issues within 3 days, I'll pass, my quest 2 has never given me issues once, and I've treated that thing like a girlfriend that's payed by the hour. I do hate to return this, as I fell in love rather quickly, but save your money and wait until they release something better, or go with a different headset.Thanks for coming to my Ted talk."
  },
  {
    "rating": "5",
    "content": "I have tried HTC Vive Pro, Valve Index and Meta Quest 2 headsets, but the most comfortable one I've come across so far is the Meta Quest Pro. While some reviewers have complained about light coming in the corners, I actually find it helps alleviate eye strain and makes VR usage more comfortable for me. ( The headset comes with a cover to block the light and it is optional if we want to have it on the headset.) Compared to the Valve Index, the Meta Quest Pro is lighter and more comfortable. I particularly appreciate being able to see my surroundings in real life while immersed in VR. During gameplay, I've noticed that using the Valve Index or Meta Quest 2 can lead to eye strain and headaches, but the Meta Quest Pro doesn't seem to cause these issues for me. I suspect this is because I can see my arms and the surrounding environment while playing games like Beat Saber, which makes the experience more enjoyable and less taxing on my eyes. Overall, I'm very satisfied with the Meta Quest Pro."
  },
  {
    "rating": "4",
    "content": "I bought this hoping to integrate some applications for design work, but nothing is compatible that I use. You can buy other applications made specifically  for the VR world, but I did not want to spend even more money just to see if it could do what I needed."
  },
  {
    "rating": "3",
    "content": "**Updated review 4/10/2023**Sure the visuals on it are pretty great but that's the only thing that it has going for it right now. The charging dock is a bit annoying to get everything lined up properly to charge. Not sure how they expect you to get anything productive done in this when the battery life on it is so terrible.If you're used to using the Quest 2 or other VR headsets, you'll need to keep in mind that this is not designed to keep as snug a fit on your face, so do not over tighten it, or you will get a headache like I did at the start. It is better when I kept it a bit looser than what I'm normally accustomed to but still didn't fly off my face when turning my head in all sorts of ways.It still needs some serious modifications if you're going to endure a work day with one of these things on."
  },
  {
    "rating": "3",
    "content": "At the moment there isn't much that this thing can do that quest 2 cant.Pros - Nice to haves, but really not game-changing for software available and real-life use case scenariosExtra FOV - not muchColor Passthrough - better but still terribleDock chargingColor is more vibranteye trackingface tracking - but why?Is meta even using these in their own collaboration? i imagine not, or else the software would be way better.Conscontroller camera tracking is actually terrible quest 2 is betterI think it feels heavier and missing the top head straponly 90 hz refresh rate! - uh what?Passthrough has too much static visual noise.This will not replace your work monitor, it could be a tool if no monitor option was available but not a better optionJust buy a quest 2 if you're considering one or the other. no reason at all to get this at the moment. I do hope that changes."
  },
  {
    "rating": "5",
    "content": "It’s pretty good. It is a little bit difficult to connect the mods for it to have facial tracking but all rest is pretty good."
  },
  {
    "rating": "2",
    "content": "If you disregard the shaping and ergonomics, then this product isn't really better than the Quest 2 in any way except for an extra hour of battery life.In fact, the Quest \"Pro\" is worse than the Quest 2 in almost every other aspect besides ergonomics and battery life!The $300 USD \"Pro\" controllers are a total scam as of June 2023.These controllers are not tracking any better.They're actually not even tracking as well as the Quest 2 controllers.If you have LED lights in your room, then they will cause the camera-tracked controllers to fail completely. Often by offsetting themselves away from your hand by at least a few inches!If I had the option to use my old Quest 2 controllers with this headset, I would not hesitate to sell the camera-tracked controllers.That's not even getting into the fact that the standalone performance is ACTUALLY WORSE than my Quest 2.It noticeably lags in its own home environment, before launching anything.It's really only usable for AirLink, which thankfully works thus far.I only got this because these ergonomics of the headset need to become the baseline standard for all HMDs.A rear-mounted battery is an ABSOLUTE REQUIREMENT for me from now on. The balance and safety improvements are not something I could possibly give up.Hardware companies need to be taking as much weight away from directly ahead of your eyes as possible, and this headset seems to be an acknowledgement of that.What a shame it is that the Quest 3 is leaping backward in that regard!I will be waiting to see if they apply lessons they've already demonstrated learning with the Quest Pro to their headset after the Quest 3 instead, regardless of processing improvements.The balance really is that much better, even after using a BOBOVR strap for my Quest 2."
  },
  {
    "rating": "5",
    "content": "It pained me to even have to send it back because I love it but it came with a defect. Screen glitches randomly. I sent it back and I’m probably going to get it through someone else so it doesn’t take that long to replace it if this happens again. Overall if it wasn’t for the defect I would have enjoyed this product. It’s not amazons fault. A lot of friends told me they have had problems with their pro. I would recommend getting insurance on this considering they have stopped production on it"
  },
  {
    "rating": "4",
    "content": "Actually works pretty well and blocks out most of the light (leaks a little around the nose). Knocked off one star because it should have come with the Quest Pro or at least been much cheaper. Your face does get warmer but that's to be expected. There's also a faint rubber smell but that will probably wear off over time."
  },
  {
    "rating": "4",
    "content": "There are plenty of reviews already. The only thing they downplay imo is how bad the native audio is."
  },
  {
    "rating": "5",
    "content": "The Meta Quest Pro is hands down the best standalone VR headset available today. If money is no object, or if your a true VR enthusiast, this is the one to buy. There is a HUGE improvement in comfort and clarity over the Quest 2. The controllers and amazing and now it comes with a charging pad. I can wear this headset for hours with not fatigue.My only wish would have been better pass through cameras for a better augmented reality experience. Also for the price they should have thrown in the complete blackout filter (approx $50 extra) not just the side filters.Meta wants this to be a business tool, but I love it for games, movies and entertainment. Not sure how this will work in a business environment, don't think we are ready for VR at work just yet. All Meta/Oculus games from prior generations of headsets work with the Quest Pro."
  },
  {
    "rating": "3",
    "content": "I was super excited for this and all the new sensors, although one thing I noticed is that the headset has the head support plastic things right in front of the speakers making it hard to hear and sound off. I recommend buying a headphone set to go with it. The price was insane even considering all the extra accessories that came with it. Overall not bad very similar to the quest 2. Just better sensors :/"
  },
  {
    "rating": "5",
    "content": "Great comfort and the small form factor made it my daily driver for social VR and my work related stuff.The controllers feel really good and have a pretty good battery life. The Headset currently loses charge when using it with the Link Cable, but it has a pretty good runtime as well. I'm sure that could be fixed with a decent USB PCIe card that has a decent power thru put.The only thing i would wish for is a software update regarding the microphone, that would allow for an array operation mode instead of a time of flight noise canceling mode. (That is my best guess) Because the microphone kinda sounds a little bit to processed in my opinion."
  },
  {
    "rating": "5",
    "content": "Look the Meta Quest Pro is one heck of a device. There is truly nothing like it. It's not perfect and depending on your preconceptions from how it was advertised, it will not be convincing for most. Nor should it be, this device is Meta's (Facebook's) first attempt to step into an AR territory. It's a great device but there's one problem. The software and AR app support is lacking. This is expected and is why this device costs so much - it's a DEV kit. It's really aimed at developers and VR/AR enthusiasts. For $1500, your likely the type of individual who has already been convinced that AR will be the next technological advancement regarding human technology interaction. For $1500 your more than likely the type of individual who wants to help make this happen, experience it and contribute to its growth."
  },
  {
    "rating": "4",
    "content": "Pros- just about everything is better than what the quest 2 has to offer.Color passthrough and AR potential (i.e., being able to play games or work and still be present with someone else in the room).Cons- comfort and needing to buy head strap accessories to reduce forehead pain.Price but hey, new tech costs money.Final thoughts- my quest 2 mostly sits in a box now."
  },
  {
    "rating": "5",
    "content": "After I got a better forehead and back of head pads, this headset became incredibly comfortable to wear.  It's very lightweight and has great visual clarity.Its battery only lasts a couple of hours, but can be used while plugged in to power or pc.  The controller's charge lasts around 10 hours and then must be recharged."
  },
  {
    "rating": "5",
    "content": "This does everything my Quest 2 does better than my Quest 2 does it and it has a lot of features the Quest 2 lacks. It's still early days for the software and hardware, but both the Quest 1 and 2 received significant updates and refinements over the first year.The face and eye tracking are excellent. I have a supported tracked pass through keyboard (Logitech 375s) and it is very good. The hand tracking is nearly perfect. The pass-through color fidelity needs improvement.I have no regrets really. If you can afford it and you want the best experience available this headset is for you.I saw in another review a complaint about jagged edges and screen door effect. I would encourage that reviewer to send it back for an exchange because there is something wrong with their unit."
  },
  {
    "rating": "5",
    "content": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n     I use my Meta Quest Pro in my executive coaching for neurodiverse leaders. It is essential because of the facial tracking so that my clients can see my facial expressions. The color passthrough is also wonderful as I can type in paper notes while using multiple monitors in the Immersed co-working app.(I also enjoy the lighter weight for my active video game play.)It can do everything that Apple Vision Pro can do at a fraction of the cost in Immersed 🤷💯"
  },
  {
    "rating": "2",
    "content": "I own a Quest 2 and have thoroughly enjoyed using it. My initial plan was to utilize the Quest Pro for both work-related productivity and gaming. Unfortunately, I encountered significant discomfort while wearing the device. After only 15 minutes of use, I experienced intense forehead pain which led to severe headaches. I discovered that wearing a beanie or hoodie alleviated the discomfort caused by the Quest Pro. However, I believe that a device with an original price of $1500 (now $1000) should not necessitate such makeshift solutions to address comfort issues; it should be comfortable right out of the box. Despite its comfort issues, another disappointing aspect of the Quest Pro is its resolution. Although the pancake lenses provide improved clarity, this enhancement is of little value when the overall resolution is underwhelming. The subpar resolution made working in applications like Immersed and Meta Workroom an eye-straining experience. The Quest Pro may have a professional appearance, but it fails to meet essential requirements such as battery life, resolution, and comfort. As much as I wanted to love this device, I ultimately had to return it. My recommendation is to either wait for a used deal (priced around $500-600) or hold out for the upcoming Quest 3."
  },
  {
    "rating": "5",
    "content": "This is what I always wanted to fix with Quest 2.Ultra sharp lens with almost edge to edge screen clarity. God rays no where to be found. The resolution is noticeably higher (could be combination of better lens + Screen) absolutely love in Microsoft Flight simulator.The tracking is out of this world (each joystick has CPU + 3 Cameras) never experienced this smoothness since CV1 days (no more missed swings in Beat Saber).Comfort is miles ahead of stock Quest 2. And the fact that it's not touching your face with floating design makes it very comfortable for long gaming sessions without face/eye strainI never bought them for  productivity, but as a gaming headset, and its the best one out there if you can afford it's price."
  },
  {
    "rating": "5",
    "content": "The Quest Pro has a few advantages over the the Quest 2.The first is comfort - despite weighing more than to the Quest 2, the Quest Pro is less cumbersome on the headband is fairly comfortable. Definitely more comfortable than the Quest 2 and the HTC Vive.The second advantage is looks. The Quest Pro's geometry is very pleasing and sleek looking.Vrchat, Beat saber, and other games run smoothly - would have been a massive waste of money if they didn't, through Vrchat occasionally lags, but I blame that on my hotspot.The hand tracking, from my limited experience with the Quest 2, is better.Overall, worth it, but for most users will want to wait for to the upcoming Quest 3 launching next year."
  },
  {
    "rating": "3",
    "content": "I thought this might actually be a good product for 'business'.  Like the idea of having multiple monitors in my pocket, love it.  But dang, this was a total disappointment. Comfort is fine aside from it smashing my glasses into my face.  Screen Door effect is BAD.  Watching videos? Dont count on it, looks like crap.  Tried to use it as a desktop, cant, you can barley read text, even if you increase the text to 160%. There was nothing about this that impressed me."
  },
  {
    "rating": "4",
    "content": "Make no mistake, even if you just use it for gaming, the Meta Quest Pro is a major upgrade from the Quest 2.  The battery lasts longer than expected when face and eye tracking is turned off, about the same as Q2.  I didn't give it 5 stars because when I plug into my brand new gaming laptop's USB charge port, it can't keep up with the drain of the headset."
  },
  {
    "rating": "3",
    "content": "We thought that the (2) we purchased would have had at least a few games free with the units (especially for the price) But SURPRISE ... NOPE you have to buy every things, games and all. The only free stuff is trials and with our schedule we never have time to learn anything about them before they expire. So not good. We love them and have used them maybe 2 or 3 times since there isn't much you can do with out the extra purchases. We can see were they will be a great item once more people get them. Home schooling or video schooling could be great."
  },
  {
    "rating": "5",
    "content": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n     Im enjoying these glasses. I created a Space  that is compatible with any quest 2 or pro model. In the Quest store download Spatial.io then Search Elijah Judah or search The Real Node LA. There's a whole community built out that is compatible with these glasses. See you At The Real Node LA. Look at the Video and you will see the glasses being used in The Real Node Theater."
  },
  {
    "rating": "5",
    "content": "I used my meta quest 2 for about a year before I tried my brother's Meta quest Pro.  Well, i was immediately sold on the upgrade because I like to use the exercise games and the Pro headset doesn't suck on to your face in so many places, it's easier to sweat in the pro headset.  Also, it's tracking is a lot smoother and it's more comfortable on your face."
  },
  {
    "rating": "5",
    "content": "Feel premium. Optics, Ergonomics, FOV all great. Only complaint is overly sensitive docking port. Something to be said about just plugging stuff in but i guess this won't wear out the port.Hope more mixed reality stuff comes out, feels like a pair of glass. Love it sits off my face."
  },
  {
    "rating": "5",
    "content": "I got the quest pro in like four days early everything synced up the charge plate. Everything charged up correctly powered on everything powered off correctly. Amazing product great quest pro I have no issues and it was early and all the games loaded up just fine. I play this thing for hours AAA plus"
  },
  {
    "rating": "5",
    "content": "I own five different headsets currently, Hp Reverb V1, V2, Index, Rift S and 2 Quest 2 all are missing something. This headset is complete with face, hand and eye tracking an outside color camera, works with fine with SteamVR and PCVR games, Portable No wires are connected to the PC air link or Virtual desktop. The tracking for the controller is as good as my Index. All is not perfect, but Meta improves over time with firmware updates. The proof of this I have forgot than Quest 2 controllers use batteries they last so long and at $1500 isn't cheap but my Index cost $1300 with an extra lighthouse."
  },
  {
    "rating": "3",
    "content": "I cannot give this 5 stars because of the price and the fact it doesn't work with the included dock that comes with the Quest Pro. At the price for the QPro it should have been included. Also a big con is that you cannot dock the QPro with this attached. Very Dumb. 3 Stars."
  },
  {
    "rating": "4",
    "content": "So Meta just lower the price permanently to 999 dollars. We’ve all been cheated. JOKE on us."
  },
  {
    "rating": "5",
    "content": "This is the best VR headset currently on the market. At its old price, the cost was very steep and generated a lot of negative reactions and frustration. At 999 it's now easily the top-of-the-line headset while actually being cheaper than some of its competitors.The tech contained in this headset is truly extraordinary, and feels VERY premium. Any VR enthusiast is totally missing out if they do not own a Quest Pro at this new price point."
  },
  {
    "rating": "3",
    "content": "For blocking light, it's fine, but I really hate having to remove it every time I want to charge the headset on the dock. Someone wasn't thinking when this was designed. I know it is easy to remove but I feel I shouldn't have to. Quality of rubber is fine."
  },
  {
    "rating": "5",
    "content": "Amazing headset and a nice step up from the Q2. I wish it worked with their recently released WiFi bridge, but I'm sure that will come with an update down the road. My only real complaint is that despite the hefty price tag, they still have screens with washed out darks and blacks. It's an improvement from the Q2, for sure, but it's still nowhere near as good as the Q1 was. It's like I have to keep my Q1 for any horror games otherwise it looks like you're in some slightly foggy area."
  },
  {
    "rating": "2",
    "content": "For $1k, I was expecting the Quest Pro to be a significant upgrade to the Quest 2.  For me, the Pro seemed to actually be a downgrade.  I have heard some people complaining of a \"screen door\" effect with the Pro but did not understand what they were talking about since I never saw that with the Quest2. I now know exactly what they are talking about.  Everything looks like you are viewing it through a screen.  Very small but noticeable grid pattern on everything.  Also noticed jagged distortion (aliasing?) on the edges of things.  The deal breaker for me was the discomfort of the Pro.  After 30 minutes I could not take it any longer and had to remove it.  I had a large red mark on my forehead that was painful and did not go away for a couple of hours.  I'm packing it back up and returning."
  },
  {
    "rating": "5",
    "content": "Its a bit overpriced for what it is. Not amazon's fault. But I do like the extra features it has, face tracking and stuff. But if your looking for a good headset that doesn't have extra goofy gadgets. Just go with quest 2 or quest 3 that comes out later this year."
  },
  {
    "rating": "5",
    "content": "If you have a Quest 2, you also need this! The passthrough feature brings together VR and the outside world.  You don't feel closed off and I find that I can spend much more time wearing the headset.The display is stunning and it fits perfectly over my large glasses (the Quest 2 does not, I had to get prescription lense for the Quest 2)The build is premium and high quality.  I hope they keep evolving the Pro line!"
  },
  {
    "rating": "2",
    "content": "I had quest 1, have quest 2 and now quest pro.  The pro is NOT worth the high price.  The best thing I can say about it and reason I use it over the quest 2 that I have is that it’s comfortable to wear.  It doesn’t sit on the face like other quests do.  Sometimes my forehead has the went numb feeling so I move the headset around.  As far as the eye and facial tracking are concerned it’s like it’s nonexistent since meta horizon is the only place I’ve been that it’s compatible with.  I hardly ever go to meta horizon so unfortunately I don’t get to use that feature of the pro.  Oh and they went down in price AFTER my purchase.  But still overpriced!"
  },
  {
    "rating": "4",
    "content": "Tech is better for sure, just bad value for money."
  },
  {
    "rating": "5",
    "content": "Meta Quest Pro  is a beast and I absolutely  support its the best headset I've ever used, totally worth the price I have no regrets"
  },
  {
    "rating": "3",
    "content": "First off, if you’re into VR to game or exercise, you’re better off trying a cheaper device like the Quest 2. If you’re looking to live that AR life then probably NReal it’s better. This device feels premium, but it under-delivers. The AR component is far too bad for a device this price, while the VR component feels like the far cheaper Quest 2. Not recommended unless you’re a developer or something pushing VR/AR and or Meta forward."
  },
  {
    "rating": "3",
    "content": "I like everything except the comfort. After 45 minutes the forehead pressure was just not acceptable. I even purchased a top strap. Less Comfortable than the quest 2. I will be returning it early next week."
  },
  {
    "rating": "2",
    "content": "For the price I really should love it. It's got a couple of problems, several of which have already been stated in other reviews: the vice-grip hold it has on your forehead, the controllers that don't track properly unless the room is really bright which causes a glare in your lenses since there's nothing covering the light, and a very sensitive charging dock. And for me, once I actually get it in the charger after having shut it down completely, it turns itself back on. The graphics are better but not mind-blowing like the price is. The full color pass through is cute but so grainy. It's unusable except to manage your way to find your water bottle and your phone. Overall, I'm shocked they released something at this price point with common issues that nearly everyone complains about is if they never tested it on real human beings."
  },
  {
    "rating": "5",
    "content": "At 1100 it's a 5 start headset, with an incredible display, amazing controllers and very solid construct. This very much feels like the \"premium\" alternative to the quest 2, but I got it on sale. I wouldn't pay 1500 for it, but 1100 feels very fair. It's a massive improvement over the next most relevant competitor at that price range (the index), so I would 100% pick up one of these over those."
  },
  {
    "rating": "2",
    "content": "Don’t waste your money… This product isn’t worth 3x the cost/value of the previous version. If it were priced 600 dollars maybe.I received mine yesterday and after using it for less than 2 hours, the battery was low, my head hurt from the mechanism used to hold the headset in place. The resolution is better and a little better field of view - noticeable but not compelling. The charging station is nice, but I had trouble lining up the controllers properly to charge them.The headset is nice but improvements don’t come close to the increase price. The cost to value is just not there.I already started the return process on Amazon. I will ship it back in the next couple of days.Major disappointment!Hopefully Apple gets it right in 2023!"
  },
  {
    "rating": "5",
    "content": "The Quest Pro with it's recent price drop is a great value.  You get great visuals, face and eye tracking.  The controllers are also fantastic.  The big weakness is comfort, but you can fix that with some third party comfort mods.  As of right now this is the VR headset to get."
  },
  {
    "rating": "2",
    "content": "So everything about this headset is really good. the screens are good, the lenses are good, it feels like a pro device. The only problem is I cannot get the controllers to work at all. It starts up fine and everything works great up untill the UI changes. Once that happens the controllers won't track. It says they're connected to the headset, the headset even gives me tracking warnings but the controllers willnot appear in VR. So it's amazing how everything is better except the one thing I need to actually use it doesn't work. Just wait for the quest 3 don't spend $1,000 on a beta test"
  },
  {
    "rating": "3",
    "content": "Got this before the price cut. But even at 1k and all it's upgrades. While the headset is more compact. It's heavy, great weigh distribution but still too heavy."
  },
  {
    "rating": "5",
    "content": "The difference in cost is substantial, but so are the improvements in the product.  Personally, I like the rechargeable controllers rather than the battery-operated in Quest 2.  The Pro also has far more granular controls when it comes to pupil distance which has a significant impact on the clarity of the VR experience.  Lastly, the controller motion tracking is much better in the Pro which matters when playing games and need precision."
  },
  {
    "rating": "5",
    "content": "Blocks light nicely.  Very helpful when playing!"
  },
  {
    "rating": "2",
    "content": "I own almost every VR kit made in the last 10 years including four Oculus Quest 2.  I'm also a VR app developer. The Quest Pro is a minor upgrade that is a step in the right direction but not at all worth the cost. It is also missing a critical piece that blocks peripheral vision and light for some reason. Why the designers decided to leave this out is baffling and disappointing. I cannot recommend this to anyone -- Even developers like myself. The account system is also an insane mess: Email account, Oculus Account, Meta Account, Facebook Account... Did you have one? Did it get merged with another? You MUST log in on your phone with some totally useless app?! What is going on with this company... Absolutely nuts."
  },
  {
    "rating": "5",
    "content": "Fantastic, the price is wild though. The weight of it is great. Performance fantastic many improvements. Not for a 999 price tag though. The screen or image quality is also highly improved as well as the focus."
  },
  {
    "rating": "1",
    "content": "Compared to the Meta Quest 2 the Pro has a stunning display. It's really something to see.I've had this for about 24 hours and have the following issues.1. The forehead strap causes severe pain and red welts. This wasn't after hours of use. This was maybe 20 min. The pain persisted until the next morning with the welt gradually subsiding. I've never had this issue before with any other VR device. Even the Quest 2 original face plate didn't give me this problem. As I write this my forehead still hurts. It's like someone took steel wool and scrubbed my forehead with it.2. The controllers are glitchy. They lose tracking and drift to different points. Mostly floating six inches or so from the real work location. It wasn't a one time problem. It happens often.3. The wifi performance is not nearly as good as the Q2. I get about 40% the performance as a Q2. Rather dismal, I think.I can't test the collaboration or anything else since I can't wear it without a large degree of pain.This device turned out to be a bitter lemon for me. It has to go back."
  },
  {
    "rating": "4",
    "content": "Really good quality but worth probably half the price."
  },
  {
    "rating": "4",
    "content": "Not very comfortable, bad fit in ears. Expected better from Meta!"
  },
  {
    "rating": "2",
    "content": "It still leaves a large gap around my nose and under my eyes. I estimate it blocks only 40% more light than the partial blockers that come with the headset. I might be able to live with that, but the real deal breaker is that it interferes with the charging dock. The headset won't fully seat on the contacts and therefore won't charge when the full light blocker is installed. It's pretty pathetic that Meta can't even design their accessories to work with their own products. This was a waste of $50."
  },
  {
    "rating": "2",
    "content": "Not worth the mot"
  },
  {
    "rating": "5",
    "content": "It is expensive, but it is also awesome. If you have the money it's worth it. If you don't, just wait for the quest 3. I love playing PCVR and this is so comfortable and clear. I love the quest 2, but I love this one more. $1200 more? Hard to say, but with how much I play VR, it's fine for me."
  },
  {
    "rating": "5",
    "content": "U need them for the OCULOUS PRO. I use them regularly.  Worth the price."
  },
  {
    "rating": "5",
    "content": "Kind of expensive but it is like having A pretty powerful computer on your head. Works great. Will connect more powerful Computer seamlessly. I don't regret it.  wellMade also.  May lead to neck pain."
  },
  {
    "rating": "5",
    "content": "No complaints"
  },
  {
    "rating": "2",
    "content": "Over priced light blockers do ok, but definitely aren't full light blockers. Light comes in over the nose. There's a reason other blockers have flaps that go over the nose. Can't use the dock with these blockers on either, prevents the charging pins from connecting. Poorly thought out designs for both the headset and blocker. Save some money and buy the cheap versions with the flaps."
  },
  {
    "rating": "5",
    "content": "I was wicked surprised by the larger FOV and how much better this runs than the quest 2. New handsets feel a bit small to me. But I'm 6'3\" so that's not a huge surprise."
  },
  {
    "rating": "5",
    "content": "Epic"
  },
  {
    "rating": "3",
    "content": "These goggles are far better than the quest 2 goggles with almost no God rays and a huge sweet spot.  That being said I don't think it's worth $1,500."
  },
  {
    "rating": "5",
    "content": "It is actually fantastic. Try it for yourself, if you do not like it then just return. Do not take hater's word for it. This is the best device on the market for its price."
  },
  {
    "rating": "2",
    "content": "Other than picture quality it doesn’t have much to like about it. I found the quest 2 more comfortable than the pro, the pressure is all on the forehead with the pro.The controllers constantly lose tracking even though they have cameras on the controller.Overall the quest 2 performs better as far as I can tell. Not sure if it’s a faulty machine from the seller or it’s really this finicky. Definitely not worth the money, makes me lose my cool when I lose my left hand all the time. Seems to not have support either."
  }
]